Repository: 84000/data-translation-memory
Catalog: toh189-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཚངས་པའི་དཔལ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble Mahāyāna Sūtra The Prediction for Brahmaśrī Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་གི་དགེ་འདུན་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: The Blessed One was dwelling in Śrāvastī, in Prince Jeta’s Grove, Anāthapiṇḍada’s Park, together with a great assembly of monks.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ་ལྷུང་བཟེད་བསྣམས་ནས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་དུ་བསོད་སྙོམས་ལ་གཤེགས་སོ། །
en: At that time, one morning the Blessed One put on his lower robe and his upper robe, took his begging bowl, and walked toward the city of Śrāvastī to collect alms.

source: ཡང་དེའི་ཚེ་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་ན་བྱིས་པ་ཕལ་པོ་ཆེ་དག་ས་རྡུལ་གྱི་ཁྱིམ་དང་། ས་རྡུལ་གྱི་ར་བ་དང་།
en: At that same time, on the outskirts of Śrāvastī, there was a group of children sitting and playing with houses of sand, surrounding walls of sand, and pavilions of sand.

source: ས་རྡུལ་གྱི་ཁང་པ་བརྩེགས་པ་དག་གིས་རྩེ་ཞིང་འཁོད་པ་ལས་བྱིས་པ་ཕལ་པོ་ཆེ་དེ་དག་གིས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་གཤེགས་པ་མཐོང་ངོ་། །
en: The group of children saw the Blessed One approaching from afar.

source: མཐོང་ནས་ཀྱང་ལྷག་པར་དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ་རྩེ་དགའ་ཞིང་འཁོད་དོ། །
en: As soon as they saw him, they were elated, delighted, and glad at heart, and they continued sitting there and playing.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཁྱེའུ་དེ་དག་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་གང་ན་ཁྱེའུ་དེ་དག་རྩེ་ཞིང་འཁོད་པའི་ས་ཕྱོགས་དེར་གཤེགས་སོ། །
en: Then, out of compassion for those children, the Blessed One went over to where they were sitting and playing.

source: དེ་ནས་བྱིས་པ་དེ་དག་གི་ནང་ནས་ཁྱེའུ་ཚངས་པའི་དཔལ་ཞེས་བྱ་བ་ཞིག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: Among the children, there was one boy named Brahmaśrī, who bowed at the feet of the Blessed One and sat right down in front of him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་བཞིན་དུ་བྱིས་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བྱིས་པ་ཁྱེད་འདི་ན་ཅི་བྱེད།
en: Even though he already knew what they would say, the Blessed One asked the children, “What are you doing, children?”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཁྱེའུ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་འདི་ནས་རྡུལ་གྱི་ཁྱིམ་དག་དང་། ས་རྡུལ་གྱི་ར་བ་དག་དང་། ས་རྡུལ་གྱི་ཁང་པ་བརྩེགས་པ་དག་གིས་རྩེ་ཞིང་མཆིས་ལགས་སོ། །
en: “Blessed One,” the children replied, “we are sitting here playing with these houses of sand, these surrounding walls of sand, and these pavilions of sand.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཁྱེའུ་ཚངས་པའི་དཔལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་ས་རྡུལ་གྱི་ཁང་པ་བརྩེགས་པ་འདི་བཞེས་སུ་གསོལ།
en: The boy Brahmaśrī then said to the Blessed One, “Out of compassion for me, Blessed One, please accept this pavilion of sand.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་ཚངས་པའི་དཔལ་གྱི་ལྷག་པའི་བསམ་པ་དང་། དགའ་བའི་སེམས་ཐུགས་སུ་ཆུད་ནས་ཐུགས་བརྩེ་བའི་ཕྱིར་ས་རྡུལ་གྱི་ཁང་པ་བརྩེགས་པ་དེ་བཞེས་སོ། །
en: The Blessed One knew the lofty ambition and exuberance in the mind of the boy Brahmaśrī and accepted the pavilion of sand out of compassion for him.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་སྐད་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལས་རྡུལ་གྱི་ཁང་པ་བརྩེགས་པ་དེ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་གྲུབ་པའི་ཁང་པ་བརྩེགས་པ་ཞིག་ཏུ་གྱུར་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན་འདུག་པར་གྱུར་ཏེ།
en: Then, through the power of the Buddha, the pavilion of sand was instantaneously transformed into a pavilion made of the seven precious jewels, and it stood there right in front of the Blessed One.

source: དེའི་ཤར་ཕྱོགས་ཀྱི་ངོས་སུ་ནི་གསེར་གྱི་ཀ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཟུག་པར་གྱུར། ལྷོ་ཕྱོགས་ཀྱི་ངོས་སུ་ནི་དངུལ་གྱི་ཀ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཟུག་པར་གྱུར། ནུབ་ཕྱོགས་ཀྱི་ངོས་སུ་ནི་བཻ་དཱུརྱའི་ཀ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཟུག་པར་གྱུར། བྱང་ཕྱོགས་ཀྱི་ངོས་སུ་ནི་ཤེལ་གྱི་ཀ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཟུག་པར་གྱུར་ཏོ། །
en: On its eastern side were 84,000 pillars of gold; on its southern side were 84,000 pillars of silver; on its western side were 84,000 pillars of beryl; and on its northern side were 84,000 pillars of crystal.

source: དེ་ནས་དེའི་ཚེ་ཁྱེའུ་ཚངས་པའི་དཔལ་གྱིས་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དེ་མཐོང་ནས་ལྷག་པར་ཡང་ཆེས་དགའ་བ་དང་།
en: When the boy Brahmaśrī saw this wondrous display of extraordinary power, he became even more elated.

source: མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་སྐྱེས་པར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཁྱེའུ་ཚངས་པའི་དཔལ་གྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཀྱེ་མ་འཇིག་རྟེན་མགོན་པོ་ཡིས། །རྫུ་འཕྲུལ་ཤིན་ཏུ་རྒྱ་ཆེན་བསྟན། །
en: The most immense joy welled up inside him, and he addressed the Blessed One with these verses: “O, the World Protector has displayed The immense expanse of his extraordinary power!

source: བདག་ཉིད་ལ་ནི་ཐུགས་བརྩེའི་ཕྱིར། །སངས་རྒྱས་ཀྱིས་ནི་རྫུ་འཕྲུལ་བསྟན། །
en: The Buddha has displayed his extraordinary power Out of compassion for me alone!

source: དྲང་སྲོང་ཆེ་ལ་བདག་གིས་ནི། །ས་རྡུལ་ཁང་བརྩེགས་ཕུལ་བ་དེ། །རིན་པོ་ཆེ་ལས་གྲུབ་པར་གྱུར། །
en: “This offering of a pavilion of sand, Which I made to the great sage, Has become something made of jewels!

source: ཀྱེ་མ་སངས་རྒྱས་བསམ་མི་ཁྱབ། །
en: O, the Buddha is inconceivable!

source: ཀྱེ་ཀྱེ་ཞིང་ནི་འདི་འདྲ་བ། །སངས་རྒྱས་ཞིང་ནི་བླ་མེད་པ། །
en: “O, O, a field such as this one, A field of a buddha, cannot be surpassed!

source: མིག་མེད་མིག་ནི་ཉམས་པ་དང་། །ཤེས་རབ་ཆུང་ངུས་མི་ཤེས་སོ། །
en: The blind, those with loss of vision, and Those with little wisdom do not know it.

source: རྐང་གཉིས་དམ་པ་འགྲོ་བའི་ཞིང་། །འདི་ནི་བདག་གིས་རྙེད་པ་དང་། །དལ་བ་རབ་དཀོན་ཐོབ་པས་ན། །བྱང་ཆུབ་ཏུ་ནི་སྨོན་ལམ་གདབ། །
en: “Best of those who walk on two feet, I aspire to achieve awakening, Having obtained this field of beings, This opportunity so hard to obtain.

source: བདག་ཀྱང་འདྲེན་པ་ཁྱོད་ཀྱི་ནི། །ཡོན་ཏན་རྗེས་སུ་སློབ་པར་འཚལ། །བླ་མེད་བྱང་ཆུབ་ཐོབ་ནས་ནི། །རྫུ་འཕྲུལ་འདི་འདྲ་བདག་གིས་བགྱི། །
en: “I, too, wish to train in the qualities That you possess, O Leader, so that, Having attained unsurpassable awakening, I can use extraordinary powers such as yours!”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་གྱི་ཁ་དོག་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ངོ་། །དེ་དག་བྱུང་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་སྟེ། ཡང་སླར་ལོག་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Then, at that moment, the Blessed One displayed a smile and various multicolored rays of light issued from the Blessed One’s mouth in such a way that blue, yellow, red, white, rose madder, crystalline, and silvery rays of light spread throughout endless, limitless world systems, reaching as far as the Brahmā realm, and then they returned, circled the Blessed One three times, and disappeared into the Blessed One’s uṣṇīṣa.

source: བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏོར་དུ་ནུབ་པར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། རྒྱལ་མཆོག་འདྲེན་པ་འགྲོ་བའི་གཙོ་བོ་རྣམས། །རྒྱུ་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན། །
en: The venerable Ānanda then addressed the Blessed One with this verse: “The supreme victors, the leaders, the chiefs among beings Do not display their smile without a reason.

source: ཐུགས་རྗེ་ལྡན་པ་འཇིག་རྟེན་སྨན་སླད་དུ། །དེང་འདིར་ཅི་ཕྱིར་འཛུམ་མཛད་བདག་ལ་གསུངས། །
en: Compassionate one, for the world’s benefit, Please tell us why you displayed a smile just now.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཁྱེའུ་ཚངས་པའི་དཔལ་འདི་མཐོང་ངམ།
en: When this had been said, the Blessed One answered the venerable Ānanda, “Ānanda, do you see this boy Brahmaśrī?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Yes, Blessed One, I see him,” he replied.

source: ཀུན་དགའ་བོ་ཁྱེའུ་འདི་དགེ་བའི་རྩ་བ་འདི་དང་། སེམས་ཀྱི་སྨོན་པ་འདིས་ནི་བསྐལ་པ་སུམ་སྟོང་ཉིས་བརྒྱའི་བར་དུ་ནམས་ཀྱང་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་མི་འགྱུར་རོ། །དེས་བྱང་ཆུབ་བསྒྲུབས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་ཞེས་བྱ་བར་འགྱུར་རོ། །ཞེས་གསུངས་སོ། །
en: “Ānanda,” said the Blessed One, “as a result of this root of virtue and this aspiration in his mind, this boy will not become a hell being for 3,200 eons, and then, once he has achieved awakening, he will be a tathāgata, a worthy one, a perfect and completely awakened buddha named The One Exalted above All the Worlds.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །སངས་རྒྱས་ལ་ནི་དད་པ་ཡིས། །བསོད་ནམས་ཆུང་ངུ་སྐྱེ་མི་འགྱུར། །
en: The Blessed One then addressed the venerable Ānanda with these verses: “Faith in the Buddha generates Merit in no small measure.

source: ཆོས་མཆོག་ཐོས་དང་དགེ་འདུན་ལ། །གུས་པར་བྱས་པའང་དེ་བཞིན་ནོ། །
en: So, too, does hearing the supreme Dharma And showing respect to the Sangha.

source: སངས་རྒྱས་ལ་ནི་དད་པ་ལ། །བྱང་ཆུབ་ཐོབ་པར་དཀའ་བ་མེད། །
en: “For those with faith in the Buddha, Attaining awakening is not difficult.

source: དེ་ཕྱིར་བྱང་ཆུབ་འདོད་པས་འདིར། །འཇིག་རྟེན་འདྲེན་རྣམས་མཆོད་པར་བྱ། །
en: Hence, those who aspire for awakening Should venerate the leaders of the world.

source: ཀུན་དགའ་ཁྱེའུ་འདི་རྐང་གཉིས་ཀྱི། །མཆོག་སྟེ་དཔལ་དང་ལྡན་པ་ཡི། །མངོན་པར་འཕགས་པ་ཞེས་བྱ་བ། །འཇིག་རྟེན་གྱི་ནི་འདྲེན་པར་འགྱུར། །
en: “Ānanda, this boy will become A glorious one, best of those who walk on two feet, A leader of the world, Called The Exalted One.

source: དེ་ལྟར་སངས་རྒྱས་བསམ་མི་ཁྱབ། །སངས་རྒྱས་ཆོས་ཀྱང་དེ་བཞིན་ཏེ། །བསམ་མི་ཁྱབ་ལ་དད་པ་ཡི། །རྣམ་པར་སྨིན་པའང་དེ་བཞིན་ནོ། །
en: “In this way, the buddhas are inconceivable And so, too, are the qualities of the buddhas; Faith in those who are inconceivable Bears fruit that is like that as well.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཁྱེའུ་ཚངས་པའི་དཔལ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ།། །།
en: After the Blessed One had spoken these words, the venerable Ānanda and the boy Brahmaśrī were delighted and they rejoiced at what the Blessed One had said.

source: འཕགས་པ་ཚངས་པའི་དཔལ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Mahāyāna sūtra “The Prediction for Brahmaśrī.”

source: རྒྱ་གར་གྱི་མཁན་པོ་བི་ཤུདྡྷ་སིདྷ་དང་། ལོཙྪ་བ་བན་དེ་དགེ་བ་དཔལ་གྱིས་བསྒྱུར།
en: Translated by the Indian preceptor Viśuddhasiṃha and the translator Bandé Gewa Pal.

source: རྒྱ་གར་གྱི་མཁན་པོ་བིདྱཱ་ཀ་ར་སིདྷ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དེ་བ་ཙནྡྲས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Edited and finalized by the Indian preceptor Vidyākarasiṃha and the great editor and translator Bandé Devacandra.
